{"format": "graph-model", "generatedBy": "2.15.1", "convertedBy": "TensorFlow.js Converter v4.22.0", "signature": {"inputs": {"embedding_input": {"name": "embedding_input:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "10"}]}}}, "outputs": {"dense": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1697"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/TensorArrayV2_1/num_elements", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/zeros_1/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/zeros_1/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/Read/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "100"}, {"size": "600"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/zeros/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/zeros/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/Read_1/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "150"}, {"size": "600"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/Read_2/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "600"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/time", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/transpose/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/while/loop_counter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/strided_slice_2/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/strided_slice_2/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/strided_slice_2/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/TensorArrayV2_1/num_elements", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/zeros_1/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/zeros_1/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/ReverseV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/Read/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "100"}, {"size": "600"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/zeros/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/zeros/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/Read_1/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "150"}, {"size": "600"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/Read_2/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "600"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/time", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/transpose/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/while/loop_counter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/strided_slice_2/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/strided_slice_2/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/strided_slice_2/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/dense/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "300"}, {"size": "1697"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/dense/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1697"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1697"}, {"size": "100"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/embedding/embedding_lookup/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "embedding_input", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "10"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/TensorArrayV2_1", "op": "TensorListReserve", "input": ["StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/TensorArrayV2_1/element_shape", "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/TensorArrayV2_1/num_elements"], "attr": {"shape_type": {"type": "DT_INT32"}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/while/enter/_44", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/bidirectional/forward_lstm/Read/ReadVariableOp"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9iaWRpcmVjdGlvbmFsL2ZvcndhcmRfbHN0bS9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/while/enter/_45", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/bidirectional/forward_lstm/Read_1/ReadVariableOp"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9iaWRpcmVjdGlvbmFsL2ZvcndhcmRfbHN0bS9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/while/enter/_46", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/bidirectional/forward_lstm/Read_2/ReadVariableOp"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9iaWRpcmVjdGlvbmFsL2ZvcndhcmRfbHN0bS9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/while/enter/_38", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/time"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9iaWRpcmVjdGlvbmFsL2ZvcndhcmRfbHN0bS9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "T": {"type": "DT_INT32"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/while/enter/_36", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/while/loop_counter"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9iaWRpcmVjdGlvbmFsL2ZvcndhcmRfbHN0bS9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "T": {"type": "DT_INT32"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/TensorArrayV2_1", "op": "TensorListReserve", "input": ["StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/TensorArrayV2_1/element_shape", "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/TensorArrayV2_1/num_elements"], "attr": {"shape_type": {"type": "DT_INT32"}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/while/enter/_104", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/bidirectional/backward_lstm/Read/ReadVariableOp"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9iaWRpcmVjdGlvbmFsL2JhY2t3YXJkX2xzdG0vUGFydGl0aW9uZWRDYWxsL3doaWxl"}, "T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/while/enter/_105", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/bidirectional/backward_lstm/Read_1/ReadVariableOp"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9iaWRpcmVjdGlvbmFsL2JhY2t3YXJkX2xzdG0vUGFydGl0aW9uZWRDYWxsL3doaWxl"}, "T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/while/enter/_106", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/bidirectional/backward_lstm/Read_2/ReadVariableOp"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9iaWRpcmVjdGlvbmFsL2JhY2t3YXJkX2xzdG0vUGFydGl0aW9uZWRDYWxsL3doaWxl"}, "T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/while/enter/_98", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/time"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9iaWRpcmVjdGlvbmFsL2JhY2t3YXJkX2xzdG0vUGFydGl0aW9uZWRDYWxsL3doaWxl"}, "T": {"type": "DT_INT32"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/while/enter/_96", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/while/loop_counter"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9iaWRpcmVjdGlvbmFsL2JhY2t3YXJkX2xzdG0vUGFydGl0aW9uZWRDYWxsL3doaWxl"}, "T": {"type": "DT_INT32"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential/embedding/Cast", "op": "Cast", "input": ["embedding_input"], "attr": {"SrcT": {"type": "DT_FLOAT"}, "DstT": {"type": "DT_INT32"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/while/enter/_39", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/TensorArrayV2_1"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9iaWRpcmVjdGlvbmFsL2ZvcndhcmRfbHN0bS9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "T": {"type": "DT_VARIANT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/while/merge/_55", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/while/enter/_44", "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/while/next_iteration/_91"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/while/merge/_56", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/while/enter/_45", "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/while/next_iteration/_92"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/while/merge/_57", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/while/enter/_46", "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/while/next_iteration/_93"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/while/merge/_49", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/while/enter/_38", "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/while/next_iteration/_85"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/while/merge/_47", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/while/enter/_36", "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/while/next_iteration/_83"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/while/enter/_99", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/TensorArrayV2_1"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9iaWRpcmVjdGlvbmFsL2JhY2t3YXJkX2xzdG0vUGFydGl0aW9uZWRDYWxsL3doaWxl"}, "T": {"type": "DT_VARIANT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/while/merge/_115", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/while/enter/_104", "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/while/next_iteration/_151"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/while/merge/_116", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/while/enter/_105", "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/while/next_iteration/_152"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/while/merge/_117", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/while/enter/_106", "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/while/next_iteration/_153"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/while/merge/_109", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/while/enter/_98", "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/while/next_iteration/_145"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/while/merge/_107", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/while/enter/_96", "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/while/next_iteration/_143"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/embedding/embedding_lookup", "op": "GatherV2", "input": ["unknown", "StatefulPartitionedCall/sequential/embedding/Cast", "StatefulPartitionedCall/sequential/embedding/embedding_lookup/axis"], "attr": {"Tparams": {"type": "DT_FLOAT"}, "Taxis": {"type": "DT_INT32"}, "Tindices": {"type": "DT_INT32"}, "_has_manual_control_dependencies": {"b": true}, "batch_dims": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/while/merge/_50", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/while/enter/_39", "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/while/next_iteration/_86"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/while/merge/_110", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/while/enter/_99", "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/while/next_iteration/_146"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/sequential/embedding/embedding_lookup"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/transpose", "op": "Transpose", "input": ["StatefulPartitionedCall/sequential/embedding/embedding_lookup", "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/transpose/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-10"}, {"size": "100"}]}, {"dim": [{"size": "3"}]}]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/sequential/embedding/embedding_lookup"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/transpose", "op": "Transpose", "input": ["StatefulPartitionedCall/sequential/embedding/embedding_lookup", "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/transpose/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-10"}, {"size": "100"}]}, {"dim": [{"size": "3"}]}]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential/bidirectional/forward_lstm/Shape", "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/strided_slice/stack", "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/strided_slice/stack_1", "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/TensorArrayUnstack/TensorListFromTensor", "op": "TensorListFromTensor", "input": ["StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/transpose", "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/TensorArrayUnstack/TensorListFromTensor/element_shape"], "attr": {"shape_type": {"type": "DT_INT32"}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/transpose"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential/bidirectional/backward_lstm/Shape", "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/strided_slice/stack", "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/strided_slice/stack_1", "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/ReverseV2", "op": "ReverseV2", "input": ["StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/transpose", "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/ReverseV2/axis"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/transpose"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/zeros_1/packed", "op": "Pack", "input": ["StatefulPartitionedCall/sequential/bidirectional/forward_lstm/strided_slice", "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/zeros_1/packed/1"], "attr": {"N": {"i": "2"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/zeros/packed", "op": "Pack", "input": ["StatefulPartitionedCall/sequential/bidirectional/forward_lstm/strided_slice", "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/zeros/packed/1"], "attr": {"N": {"i": "2"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/while/enter/_43", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/TensorArrayUnstack/TensorListFromTensor"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9iaWRpcmVjdGlvbmFsL2ZvcndhcmRfbHN0bS9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "T": {"type": "DT_VARIANT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/Shape", "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/strided_slice/stack", "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/strided_slice/stack_1", "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/zeros_1/packed", "op": "Pack", "input": ["StatefulPartitionedCall/sequential/bidirectional/backward_lstm/strided_slice", "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/zeros_1/packed/1"], "attr": {"N": {"i": "2"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/zeros/packed", "op": "Pack", "input": ["StatefulPartitionedCall/sequential/bidirectional/backward_lstm/strided_slice", "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/zeros/packed/1"], "attr": {"N": {"i": "2"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/TensorArrayUnstack/TensorListFromTensor", "op": "TensorListFromTensor", "input": ["StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/ReverseV2", "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/TensorArrayUnstack/TensorListFromTensor/element_shape"], "attr": {"shape_type": {"type": "DT_INT32"}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/Shape", "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/strided_slice/stack", "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/strided_slice/stack_1", "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/zeros_1", "op": "Fill", "input": ["StatefulPartitionedCall/sequential/bidirectional/forward_lstm/zeros_1/packed", "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/zeros_1/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "index_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/zeros", "op": "Fill", "input": ["StatefulPartitionedCall/sequential/bidirectional/forward_lstm/zeros/packed", "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/zeros/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "index_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/while/merge/_54", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/while/enter/_43", "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/while/next_iteration/_90"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/while/enter/_42", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/strided_slice"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9iaWRpcmVjdGlvbmFsL2ZvcndhcmRfbHN0bS9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "T": {"type": "DT_INT32"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/zeros_1", "op": "Fill", "input": ["StatefulPartitionedCall/sequential/bidirectional/backward_lstm/zeros_1/packed", "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/zeros_1/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "index_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/zeros", "op": "Fill", "input": ["StatefulPartitionedCall/sequential/bidirectional/backward_lstm/zeros/packed", "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/zeros/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "index_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/while/enter/_103", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/TensorArrayUnstack/TensorListFromTensor"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9iaWRpcmVjdGlvbmFsL2JhY2t3YXJkX2xzdG0vUGFydGl0aW9uZWRDYWxsL3doaWxl"}, "T": {"type": "DT_VARIANT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/while/enter/_102", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/strided_slice"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9iaWRpcmVjdGlvbmFsL2JhY2t3YXJkX2xzdG0vUGFydGl0aW9uZWRDYWxsL3doaWxl"}, "T": {"type": "DT_INT32"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/while/enter/_41", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/bidirectional/forward_lstm/zeros_1"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9iaWRpcmVjdGlvbmFsL2ZvcndhcmRfbHN0bS9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/while/enter/_40", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/bidirectional/forward_lstm/zeros"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9iaWRpcmVjdGlvbmFsL2ZvcndhcmRfbHN0bS9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/while/merge/_53", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/while/enter/_42", "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/while/next_iteration/_89"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/while/enter/_101", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/bidirectional/backward_lstm/zeros_1"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9iaWRpcmVjdGlvbmFsL2JhY2t3YXJkX2xzdG0vUGFydGl0aW9uZWRDYWxsL3doaWxl"}, "T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/while/enter/_100", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/bidirectional/backward_lstm/zeros"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9iaWRpcmVjdGlvbmFsL2JhY2t3YXJkX2xzdG0vUGFydGl0aW9uZWRDYWxsL3doaWxl"}, "T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/while/merge/_114", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/while/enter/_103", "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/while/next_iteration/_150"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/while/merge/_113", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/while/enter/_102", "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/while/next_iteration/_149"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/while/merge/_52", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/while/enter/_41", "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/while/next_iteration/_88"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/while/merge/_51", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/while/enter/_40", "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/while/next_iteration/_87"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/while/cond/_34/while/Less", "op": "Less", "input": ["StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/while/merge/_49", "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/while/merge/_53", "^StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/while/merge/_47"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/while/merge/_112", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/while/enter/_101", "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/while/next_iteration/_148"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/while/merge/_111", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/while/enter/_100", "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/while/next_iteration/_147"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/while/cond/_94/while/Less", "op": "Less", "input": ["StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/while/merge/_109", "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/while/merge/_113", "^StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/while/merge/_107"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/while/LoopCond/_58", "op": "LoopCond", "input": ["StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/while/cond/_34/while/Less"]}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/while/LoopCond/_118", "op": "LoopCond", "input": ["StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/while/cond/_94/while/Less"]}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/while/Func/StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/input/_14_switch/_64", "op": "Switch", "input": ["StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/while/merge/_52", "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/while/LoopCond/_58"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/while/StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/TensorArrayUnstack/TensorListFromTensor_switch/_66", "op": "Switch", "input": ["StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/while/merge/_54", "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/while/LoopCond/_58"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/while/Func/StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/input/_15_switch/_67", "op": "Switch", "input": ["StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/while/merge/_55", "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/while/LoopCond/_58"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/while/Func/StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/input/_13_switch/_63", "op": "Switch", "input": ["StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/while/merge/_51", "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/while/LoopCond/_58"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/while/Func/StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/input/_16_switch/_68", "op": "Switch", "input": ["StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/while/merge/_56", "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/while/LoopCond/_58"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/while/Func/StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/input/_17_switch/_69", "op": "Switch", "input": ["StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/while/merge/_57", "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/while/LoopCond/_58"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/while/StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/time_switch/_61", "op": "Switch", "input": ["StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/while/merge/_49", "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/while/LoopCond/_58"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/while/StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/while/loop_counter_switch/_59", "op": "Switch", "input": ["StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/while/merge/_47", "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/while/LoopCond/_58"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/while/StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/TensorArrayV2_1_switch/_62", "op": "Switch", "input": ["StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/while/merge/_50", "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/while/LoopCond/_58"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/while/StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/strided_slice_switch/_65", "op": "Switch", "input": ["StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/while/merge/_53", "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/while/LoopCond/_58"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/while/Func/StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/input/_25_switch/_124", "op": "Switch", "input": ["StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/while/merge/_112", "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/while/LoopCond/_118"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/while/StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/TensorArrayUnstack/TensorListFromTensor_switch/_126", "op": "Switch", "input": ["StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/while/merge/_114", "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/while/LoopCond/_118"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/while/Func/StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/input/_26_switch/_127", "op": "Switch", "input": ["StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/while/merge/_115", "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/while/LoopCond/_118"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/while/Func/StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/input/_24_switch/_123", "op": "Switch", "input": ["StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/while/merge/_111", "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/while/LoopCond/_118"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/while/Func/StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/input/_27_switch/_128", "op": "Switch", "input": 